export interface WordCategory {
  name: string;
  words: string[];
}

export const hebrewWordCategories: WordCategory[] = [
  {
    name: 'חיות',
    words: [
      'כלב', 'חתול', 'סוס', 'פיל', 'ארנב', 'תוכי', 'צב', 'דולפין',
      'נחש', 'אריה', 'ג\'ירפה', 'קוף', 'פרה', 'כבשה', 'עז', 'זאב',
      'שועל', 'דוב', 'קנגורו', 'פינגווין', 'תנין', 'זברה', 'היפופוטם',
      'נמר', 'עכבר', 'ברווז', 'תרנגול', 'דג', 'חמור', 'עוף',
      'צרצר', 'דבורה', 'עורב', 'כנשר', 'טיגריס', 'יונה',
      'שימפנזה', 'גוריל', 'ארנגוטן' ,'תנין',
    ],
  },
  {
    name: 'אוכל',
    words: [
      'פיצה', 'המבורגר', 'שוקולד', 'גלידה', 'עוגה', 'לחם', 'ביצה',
      'עגבנייה', 'תפוח', 'בננה', 'ענבים', 'תות', 'אבטיח', 'דבש',
      'גבינה', 'פסטה', 'סושי', 'סלט', 'מרק', 'חמוצים', 'פלאפל',
      'שווארמה', 'חומוס', 'טחינה', 'בורקס', 'כנפיים', 'שניצל',
      'קרואסון', 'וופל', 'דונאט', 'קפה', 'תה', 'מיץ', 'יוגורט',
      'סלמון', 'סטייק', 'עוף', 'כריך', 'בייגל', 'מקרונה',
      'אורז', 'אגוז', 'שקדים', 'דקל', 'זיתים', 'לימון',
      'כרוב', 'מלפפון', 'תירס', 'ברוקולי', 'תפוח אדמה',
    ],
  },
  {
    name: 'מקומות',
    words: [
      'ים', 'הר', 'מדבר', 'יער', 'עיר', 'כפר', 'מסעדה', 'בית ספר',
      'בית חולים', 'שדה תעופה', 'ספרייה', 'גן', 'חוף', 'בריכה',
      'גשר', 'מוזיאון', 'קניון', 'פארק', 'תחנת רכבת', 'נמל',
      'מגדלור', 'מבצר', 'מקדש', 'אצטדיון', 'תיאטרון', 'מלון',
      'בית כלא', 'תחנת משטרה', 'כיכר', 'קולנוע', 'בנק',
      'משרד', 'מטבח', 'חדר שינה', 'מקלחת', 'מרפאה', 'בריכת שחייה',
      'טרמינל', 'רחוב', 'גן חיות', 'כנסיה', 'מסגד',
      'מסעדת פסט פוד', 'קאפה', 'סלון', 'מכבסה', 'פרחיית', 'גן ילדים',
    ],
  },
  {
    name: 'חפצים',
    words: [
      'מפתח', 'טלפון', 'ספר', 'כיסא', 'שולחן', 'מראה', 'מגבת',
      'מסרק', 'כובע', 'נעל', 'שעון', 'מצלמה', 'מטריה', 'מזוודה',
      'פנס', 'כרית', 'שמיכה', 'מחשב', 'טלוויזיה', 'מטאטא',
      'סכין', 'כוס', 'צלחת', 'כפית', 'מזלג', 'קסדה',
      'אוזניות', 'משקפיים', 'תיק', 'עפרון', 'עט', 'מחברת',
      'ספה', 'שידה', 'מנורה', 'שטיח', 'תמונה', 'וילון',
      'כלי בישול', 'תנור', 'מקרר', 'מדיח כלים', 'מכונת כביסה', 'שואב אבק',
      'בדיקה', 'מדפסת', 'סורק' ,'דרך', 'כרטיס זיכרון',
    ],
  },
  {
    name: 'מקצועות',
    words: [
      'רופא', 'מורה', 'טבח', 'שוטר', 'כבאי', 'עורך דין', 'טייס',
      'ספר', 'שחקן', 'זמר', 'שף', 'מהנדס', 'אדריכל', 'כלכלן',
      'עיתונאי', 'צלם', 'פסיכולוג', 'רב', 'מנהל', 'חקלאי',
      'ספרן', 'רופא שיניים', 'פיזיותרפיסט', 'סופר', 'מוזיקאי',
      'כדורגלן', 'מחנך', 'נהג', 'שמאי', 'מלצר', 'טכנאי',
      'מכניק', 'ממציא', 'כימאי', 'ביולוג', 'אסטרונאוט', 'היסטוריון',
      'ארכיאולוג', 'אנתרופולוג', 'סוציולוג', 'פיזיקאי', 'מתמטיקאי', 
      'חייט', 'נעליים', 'ראפר' ,'יועץ',
    ],
  },
  {
    name: 'ספורט',
    words: [
      'כדורגל', 'כדורסל', 'טניס', 'שחייה', 'אופניים', 'ריצה',
      'גלישה', 'סקי', 'קפיצה', 'אגרוף', 'כדורעף', 'גולף',
      'פינג פונג', 'כדוריד', 'רכיבה', 'דיג', 'ירי',
      'חץ וקשת', 'התעמלות', 'בוקסה', 'ג\'ודו', 'קראטה', 'הוקי',
      'קריקט', 'בטבול', 'סקייטבורד', 'רוללר סקייט', 'דודבול',
      'בייסבול', 'סופטבול','אתלטיקה',
    ],
  },
  {
    name: 'טבע',
    words: [
      'שמש', 'ירח', 'כוכב', 'ענן', 'גשם', 'שלג', 'ברק', 'רוח',
      'פרח', 'עץ', 'נהר', 'אגם', 'הר געש', 'מפל', 'מערה',
      'מדרון', 'ביצה', 'צוק', 'שונית', 'גל', 'קרח',
      'קור', 'חום', 'אבן', 'חול', 'עלה',
      'זר עלים', 'שיח', 'שורש', 'גבעה', 'עמק', 'אדמה',
      'סלע', 'מינרל', 'גבישים', 'יהלום',  'פנינה',
      'סוואנה', 'ג\'ונגל', 'אקלים', 'סערה', 'תופעה', 'טורנדו',
    ],
  },
  {
    name: 'כלי רכב',
    words: [
      'מכונית', 'אוטובוס', 'רכבת', 'מטוס', 'אופנוע', 'אופניים',
      'ספינה', 'סירה', 'מסוק', 'טנק', 'רקטה', 'מרכבה', 'כבאית',
      'אמבולנס', 'משאית', 'טרקטור', 'עגלה', 'קטנוע', 'רכב שטח', 'כרכרה',
      'סוס', 'גמל', 'סל אוויר', 'יאכטה',
      'קיאק', 'משוטים', 'סקי', 'סנובורד', 'בלון',
    ],
  },
  {
    name: 'טכנולוגיה',
    words: [
      'מחשב', 'טלפון חכם', 'טאבלט', 'מסך', 'מקלדת', 'עכבר',
      'מדפסת', 'סורק', 'כרטיס קרדיט', 'אינטרנט', 'אתר', 'סלולרי',
      'ווטסאפ', 'פייסבוק', 'טוויטר', 'אינסטגרם', 'יוטיוב', 'גוגל',
      'ג\'ימייל', 'קלאוד', 'בענן', 'רובוט', 'תוכנה', 'קוד',
      'מעבד', 'זיכרון', 'דיסק', 'שרת', 'בדיקה', 'תור',
      'וויפיי', 'בלוטות',
    ],
  },
  {
    name: 'דמויות ספרות',
    words: [
      'הארי פוטר', 'שרלוק הולמס', 'אוליבר טוויסט', 'פרוזן',
      'סימבה', 'מיקי מאוס', 'מיני מאוס', 'דונלד דאק',
      'טום וג\'רי', 'בוג\'ס באני', 'סימפסון',
      'ג\'יני', 'שכן', 'באטמן', 'סופרמן', 'איירון מן',
      'ספיידר מן', 'האלק', 'בן 10', 'דורה', 'פאו פטרול',
      'סינדרלה', 'שלגייה ושבע הגמדים', 'ג\'אסמין'
    ],
  },
];

export const getRandomWordWithCategory = (): { word: string; category: string } => {
  const category = hebrewWordCategories[Math.floor(Math.random() * hebrewWordCategories.length)];
  const word = category.words[Math.floor(Math.random() * category.words.length)];
  return { word, category: category.name };
};
